# replace関数の使い方
## https://note.nkmk.me/python-pandas-replace/

In [38]:
import pandas as pd

In [62]:
df = pd.read_csv('/Users/motegihayato/Sync/hayato.dailylife@gmail.com/data_science/jupyterlab/test/replace/sample_pandas_normal.csv')
print(df)
#print(df)
#       name  age state  point
# 0    Alice   24    NY     64
# 1      Bob   42    CA     24
# 2  Charlie   18    CA     70
# 3     Dave   68    TX     70
# 4    Ellen   24    CA     88
# 5    Frank   30    NY     57

      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
3     Dave   68    TX     70
4    Ellen   24    CA     88
5    Frank   30    NY     57

In [74]:
print(df.iloc[0, 0])
print(df.iloc[0, 1])
print(df.iloc[0, 2])
print(df.iloc[0, 3])
print("- - - - - - - - - - - - - ")
print(df.iloc[1, 0])
print(df.iloc[1, 1])
print(df.iloc[1, 2])
print(df.iloc[1, 3])
print("- - - - - - - - - - - - - ")
print(df.iloc[2, 0])
print(df.iloc[2, 1])
print(df.iloc[2, 2])
print(df.iloc[2, 3])
print("- - - - - - - - - - - - - ")
print(df.iloc[3, 0])
print(df.iloc[3, 1])
print(df.iloc[3, 2])
print(df.iloc[3, 3])
print("- - - - - - - - - - - - - ")
print(df.iloc[4, 0])
print(df.iloc[4, 1])
print(df.iloc[4, 2])
print(df.iloc[4, 3])

Alice
24
NY
64
- - - - - - - - - - - - -
Bob
42
CA
92
- - - - - - - - - - - - -
Charlie
18
CA
70
- - - - - - - - - - - - -
Dave
68
TX
70
- - - - - - - - - - - - -
Ellen
24
CA
88

In [77]:
print(df)
print("- - - - - - - - - - - - - ")
print(df.replace('CA', 'California'))
#       name  age       state  point
# 0    Alice   24          NY     64
# 1      Bob   42  California     24
# 2  Charlie   18  California     70
# 3     Dave   68          TX     70
# 4    Ellen   24  California     88
# 5    Frank   30          NY     57

      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
3     Dave   68    TX     70
4    Ellen   24    CA     88
5    Frank   30    NY     57
- - - - - - - - - - - - -
      name  age       state  point
0    Alice   24          NY     64
1      Bob   42  California     92
2  Charlie   18  California     70
3     Dave   68          TX     70
4    Ellen   24  California     88
5    Frank   30          NY     57

In [78]:
print(df)
print("- - - - - - - - - - - - - ")
print(df.replace(24, 100))
#       name  age state  point
# 0    Alice  100    NY     64
# 1      Bob   42    CA    100
# 2  Charlie   18    CA     70
# 3     Dave   68    TX     70
# 4    Ellen  100    CA     88
# 5    Frank   30    NY     57

      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
3     Dave   68    TX     70
4    Ellen   24    CA     88
5    Frank   30    NY     57
- - - - - - - - - - - - -
      name  age state  point
0    Alice  100    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
3     Dave   68    TX     70
4    Ellen  100    CA     88
5    Frank   30    NY     57

In [80]:
print(df)
print("- - - - - - - - - - - - - ")
print(df.replace({'CA': 'California', 24: 100}))
#       name  age       state  point
# 0    Alice  100          NY     64
# 1      Bob   42  California    100
# 2  Charlie   18  California     70
# 3     Dave   68          TX     70
# 4    Ellen  100  California     88
# 5    Frank   30          NY     57

      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
3     Dave   68    TX     70
4    Ellen   24    CA     88
5    Frank   30    NY     57
- - - - - - - - - - - - -
      name  age       state  point
0    Alice  100          NY     64
1      Bob   42  California     92
2  Charlie   18  California     70
3     Dave   68          TX     70
4    Ellen  100  California     88
5    Frank   30          NY     57

In [ ]:
print(df.replace(['CA', 24], ['California', 100]))
#       name  age       state  point
# 0    Alice  100          NY     64
# 1      Bob   42  California    100
# 2  Charlie   18  California     70
# 3     Dave   68          TX     70
# 4    Ellen  100  California     88
# 5    Frank   30          NY     57

# print(df.replace(['CA', 24, 'NY'], ['California', 100]))
# ValueError: Replacement lists must match in length. Expecting 3 got 2